Ran Plan for 3 projects:

1. dir: `module/firewall` workspace: `default`
1. dir: `terraform/staging/peering/peer-api-deploy` workspace: `default`
1. dir: `terraform/staging/peering/peer-deploy-api` workspace: `default`

### 1. dir: `module/firewall` workspace: `default`
**Plan Error**
```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/Lendy10/terraform/14/default/module/firewall": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/Lendy10/terraform/14/default/module/firewall": 
time=2022-11-16T04:19:43Z level=error msg=Error reading file at path /root/.atlantis/repos/Lendy10/terraform/14/default/module/firewall/terragrunt.hcl: open /root/.atlantis/repos/Lendy10/terraform/14/default/module/firewall/terragrunt.hcl: no such file or directory
time=2022-11-16T04:19:43Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `terraform/staging/peering/peer-api-deploy` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2022-11-16T04:19:45Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terragrunt-atlantis. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-api-deploy] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.43.0"...
- Installing hashicorp/google v4.43.0...
- Installed hashicorp/google v4.43.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network_peering.default will be created
  + resource "google_compute_network_peering" "default" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = true
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + name                                = "peer-api-deploy"
      + network                             = "projects/studied-union-367003/global/networks/vpc-api"
      + peer_network                        = "projects/studied-union-367003/global/networks/vpc-atlantis-check"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-api-deploy/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-api-deploy/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/staging/peering/peer-api-deploy`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.162.86/lock?id=Lendy10%252Fterraform%252Fterraform%252Fstaging%252Fpeering%252Fpeer-api-deploy%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/staging/peering/peer-api-deploy`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terraform/staging/peering/peer-deploy-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2022-11-16T04:19:49Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terragrunt-atlantis. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-deploy-api] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.43.0"...
- Installing hashicorp/google v4.43.0...
- Installed hashicorp/google v4.43.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network_peering.default will be created
  + resource "google_compute_network_peering" "default" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = true
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + name                                = "peer-api-deploy"
      + network                             = "projects/studied-union-367003/global/networks/vpc-atlantis-check"
      + peer_network                        = "projects/studied-union-367003/global/networks/vpc-api"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-deploy-api/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/Lendy10/terraform/14/default/terraform/staging/peering/peer-deploy-api/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/staging/peering/peer-deploy-api`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.162.86/lock?id=Lendy10%252Fterraform%252Fterraform%252Fstaging%252Fpeering%252Fpeer-deploy-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/staging/peering/peer-deploy-api`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
